---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.CostRatePower
source: html/d193067e-b15e-a438-d539-dcfa37b16172.htm
---
# Autodesk.Revit.DB.SpecTypeId.CostRatePower Property

Cost Rate Power, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId CostRatePower { get; }
```